/************************************************************************/
/* 파일 : randomnumber.c */ 
/************************************************************************/

#include "numberguess.h"

static int max = LIMIT;
static int min = 1;

/////////////////////////////////////////////////////////////
void setNumber() 
{
	int seed;
	extern number;

	seed = time(NULL);
	srand(seed);
	number = rand() % LIMIT + 1;
}

/////////////////////////////////////////////////////////////
void printHead() 
{
	printf("1에서 %d까지의 하나의 정수가 결정되었습니다.\n", LIMIT);
	printf("이 정수를 맞추어 보세요? > ");
}

/////////////////////////////////////////////////////////////
void printHigher(int guess) 
{
	printf("\n맞추어야 할 정수가 입력한 정수 %d보다 큽니다.\n", guess);
	min = guess + 1;
	printf("%d에서 %d사이의 정수를 다시 입력하세요. > ", min, max);
}

/////////////////////////////////////////////////////////////
void printLower(int guess) 
{
	printf("\n맞추어야 할 정수가 입력한 정수 %d보다 작습니다.\n", guess);
	max = guess - 1;
	printf("%d에서 %d사이의 정수를 다시 입력하세요. > ", min, max);
}

/////////////////////////////////////////////////////////////
void printAnswer() 
{
	extern number;
	printf("\n축하합니다! 정답은 %d입니다.\n", number);
}
/************************************************************************/